# Movies Tonight Part 3: SQL DML

In [1]:
%load_ext sql
%sql sqlite:///Movies.db

'Connected: @Movies.db'

1. **Load the `DATASET.csv` file into the `Movies.db` database.**  
    - Import the CSV file to create a new table called `DATASET`. Follow the example [here](http://www.sqlitetutorial.net/sqlite-import-csv/).
    - Use a [`PRAGMA table-info` pseudo-query](https://www.sqlite.org/pragma.html#pragma_table_info) to inspect the design of the new table. [How are we going to handle dates](https://www.sqlite.org/datatype3.html)?

2. **Populate the tables with data.**  

    - Use `INSERT ... SELECT ...` queries to extract data from `DATASET` for each table of your other tables. 
    - Start with the strong entities before moving on to the weak ones. Be sure to always select distinct     values. 
    - Foreign Keys get special treatment. You will have to use JOINs to pick up the PKs from the other side of the relationships. (As in Part 1, use the fact that movie names, theater names, and people names are always unique in our source data. That way you can use then for the JOIN columns. 
    - If you have to start over, then rerun your DDL queries from Part 2.

In [2]:
%%sql
INSERT INTO MOVIES (MovieTitle, Rating)
    SELECT DISTINCT MTitle, Rating
    FROM DATASET ;

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'INSERT INTO MOVIES (MovieTitle, Rating)\n    SELECT DISTINCT MTitle, Rating\n    FROM DATASET ;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [3]:
%%sql
SELECT *
FROM MOVIES

 * sqlite:///Movies.db
Done.

[]

In [4]:
%%sql 
INSERT INTO THEATER (TheaterName, PhoneNumber, Location)
    SELECT DISTINCT TName, Phone, Location
    FROM DATASET ;

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'INSERT INTO THEATER (TheaterName, PhoneNumber, Location)\n    SELECT DISTINCT TName, Phone, Location\n    FROM DATASET ;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [5]:
%%sql
SELECT *
FROM THEATER

 * sqlite:///Movies.db
Done.

[]

In [6]:
%%sql
INSERT INTO ARTIST (ArtistName)
SELECT DISTINCT CName 
    FROM DATASET ;

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'INSERT INTO ARTIST (ArtistName)\nSELECT DISTINCT CName \n    FROM DATASET ;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [7]:
%%sql 
INSERT INTO CREDIT (MovieID, ArtistID, CreditCode)
SELECT DISTINCT MovieID, CCode, ArtistID 
    FROM DATASET
    JOIN Movies ON (Movies.MovieTitle=DATASET.MTitle)
    JOIN Artist ON (Artist.ArtistName=DATASET.CName) ;

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'INSERT INTO CREDIT (MovieID, ArtistID, CreditCode)\nSELECT DISTINCT MovieID, CCode, ArtistID \n    FROM DATASET\n    JOIN Movies ON (Movies.MovieTitle=DATASET.MTitle)\n    JOIN Artist ON (Artist.ArtistName=DATASET.CName) ;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [8]:
%%sql
INSERT INTO SHOW (MovieID, TheaterID, ShowTime)
SELECT DISTINCT MovieID, TheaterID, ShowTime
FROM DATASET
    JOIN Movies ON (DATASET.MTitle=Movies.MovieTitle)
    JOIN Theater ON (DATASET.TName=Theater.TheaterName) ;

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'INSERT INTO SHOW (MovieID, TheaterID, ShowTime)\nSELECT DISTINCT MovieID, TheaterID, ShowTime\nFROM DATASET\n    JOIN Movies ON (DATASET.MTitle=Movies.MovieTitle)\n    JOIN Theater ON (DATASET.TName=Theater.TheaterName) ;'] (Background on this error at: http://sqlalche.me/e/e3q8)

3. **Check your work.**  
There are 9 theaters, 23 movies, 152 artists, 131 shows, and 161 credits.

In [9]:
%%sql
SELECT COUNT (*)
    FROM MOVIES

 * sqlite:///Movies.db
Done.

[(0,)]

In [10]:
%%sql
SELECT COUNT (*)
    FROM THEATER

 * sqlite:///Movies.db
Done.

[(0,)]

In [11]:
%%sql
SELECT COUNT (*)
    FROM ARTIST

 * sqlite:///Movies.db
Done.

[(0,)]

In [12]:
%%sql
SELECT COUNT (*)
    FROM SHOW

 * sqlite:///Movies.db
Done.

[(0,)]

In [13]:
%%sql
SELECT COUNT (*)
    FROM CREDIT

 * sqlite:///Movies.db
Done.

[(0,)]

4. **Now check the source data.**  
There are actually 13 duplicate rows in the original source data! Can you spot them? Write a SQL query that counts how many times each (MTitle, TName, Showtime, CCode, and CName) appears. Which ones appear more than once?

In [14]:
%%sql 
SELECT DISTINCT COUNT(*)
    FROM DATASET

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'SELECT DISTINCT COUNT(*)\n    FROM DATASET'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [15]:
%%sql 
SELECT COUNT(*)
    FROM DATASET ;

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'SELECT COUNT(*)\n    FROM DATASET ;'] (Background on this error at: http://sqlalche.me/e/e3q8)

5. **Drop the `DATASET` table.**  
We don't need it anymore.

In [16]:
%%sql
DROP TABLE DATASET;

 * sqlite:///Movies.db
(sqlite3.OperationalError) no such table: DATASET [SQL: 'DROP TABLE DATASET;'] (Background on this error at: http://sqlalche.me/e/e3q8)

6. **Save, commit, and push your work to GitHub.**  
Use the commit summary comment "Completed Part 3".